README.md
<h1> CheatSheet </h1>

This project is to contain a listing of termiology and basics
for Goju Ryu karate.

**The listing sheet, as PDF, can be found
[here](<https://github.com/alhassy/GojuRyuCheatSheet/blob/master/CheatSheet.pdf>)**, 
while below is an unruly html rendition.

This reference sheet is built around the system
<https://github.com/alhassy/CheatSheet>.


# Table of Contents

1.  [Dachi &#x2013;Stance](#org792d3aa)
2.  [Uke &#x2013;Block](#org852ddde)
3.  [Te &#x2013;Hand Strikes](#org8618f12)
4.  [Geri &#x2013;Kick](#orgffff944)
5.  [Kata  &#x2013;Forms](#orgacc4085)
6.  [Goju History](#org00ddd4c)
7.  [Local Goju History](#org4071813)
8.  [General Terms](#org3238bad)













<a id="org792d3aa"></a>

# Dachi &#x2013;Stance

<div class="org-center">
*Power is rooted in the feet, developed by the knees, and directed by the hips!*
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Heiko     dachi</td>
<td class="org-left">Natural stance</td>
</tr>


<tr>
<td class="org-left">Heisoku   dachi</td>
<td class="org-left">Attention stance</td>
</tr>


<tr>
<td class="org-left">Zenkutsu  dachi</td>
<td class="org-left">Forward stance</td>
</tr>


<tr>
<td class="org-left">Shiko     dachi</td>
<td class="org-left">Horse, Straddle stance</td>
</tr>


<tr>
<td class="org-left">Sanchin   dachi</td>
<td class="org-left">Hour Glass, Power   stance</td>
</tr>


<tr>
<td class="org-left">Neko ashi dachi</td>
<td class="org-left">Cat stance</td>
</tr>


<tr>
<td class="org-left">Tsuru ashi dachi</td>
<td class="org-left">Stork stance</td>
</tr>


<tr>
<td class="org-left">Teiji dachi</td>
<td class="org-left">t-stance</td>
</tr>


<tr>
<td class="org-left">Kokutsu dachi</td>
<td class="org-left">back stance</td>
</tr>
</tbody>
</table>


<a id="org852ddde"></a>

# Uke &#x2013;Block

<div class="org-center">
*90% of blocks are executed with the front hand, making it easier to counter!*
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Gedan bari</td>
<td class="org-left">Low sweeping block</td>
</tr>


<tr>
<td class="org-left">Jodan uke</td>
<td class="org-left">Rising block</td>
</tr>


<tr>
<td class="org-left">Chudan uke</td>
<td class="org-left">Inside forearm block</td>
</tr>


<tr>
<td class="org-left">Soto uke</td>
<td class="org-left">Outside forearm block</td>
</tr>


<tr>
<td class="org-left">Hariatoshi</td>
<td class="org-left">Low 3 point block</td>
</tr>


<tr>
<td class="org-left">Kakewaki uke</td>
<td class="org-left">Cross block</td>
</tr>


<tr>
<td class="org-left">Mawashi uke</td>
<td class="org-left">Roundhouse block</td>
</tr>


<tr>
<td class="org-left">Kake uke</td>
<td class="org-left">Hook block</td>
</tr>


<tr>
<td class="org-left">Hiza uke</td>
<td class="org-left">Shin block</td>
</tr>


<tr>
<td class="org-left">Kakuto uke</td>
<td class="org-left">Crane head block</td>
</tr>


<tr>
<td class="org-left">Shuto uke</td>
<td class="org-left">Knife hand block</td>
</tr>


<tr>
<td class="org-left">Morto uke</td>
<td class="org-left">Augmented forearm block</td>
</tr>


<tr>
<td class="org-left">Teisho uke</td>
<td class="org-left">Palm block</td>
</tr>
</tbody>
</table>

\newpage


<a id="org8618f12"></a>

# Te &#x2013;Hand Strikes

<div class="org-center">
*The principles of expansion and contraction are a must when striking and as well for blocking!*
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Oi zuki</td>
<td class="org-left">Lunge punch</td>
</tr>


<tr>
<td class="org-left">Gy Aku zuki</td>
<td class="org-left">Reverse punch</td>
</tr>


<tr>
<td class="org-left">Kizama zuki</td>
<td class="org-left">Front jab</td>
</tr>


<tr>
<td class="org-left">Morto zuki</td>
<td class="org-left">Double fist punch</td>
</tr>


<tr>
<td class="org-left">Rek Ken</td>
<td class="org-left">Backfist</td>
</tr>


<tr>
<td class="org-left">Ura Ken</td>
<td class="org-left">Back fist</td>
</tr>


<tr>
<td class="org-left">Tetsui</td>
<td class="org-left">Hammer fist</td>
</tr>


<tr>
<td class="org-left">Shuto</td>
<td class="org-left">Knifehand</td>
</tr>


<tr>
<td class="org-left">Teisho</td>
<td class="org-left">Palm heel</td>
</tr>


<tr>
<td class="org-left">Empi</td>
<td class="org-left">Elbow</td>
</tr>


<tr>
<td class="org-left">Mawashi zuki</td>
<td class="org-left">Hook punch</td>
</tr>


<tr>
<td class="org-left">Nukite</td>
<td class="org-left">Finger strike</td>
</tr>
</tbody>
</table>


<a id="orgffff944"></a>

# Geri &#x2013;Kick

<div class="org-center">
*Except the instep roundhouse, remember to curl your toes for each and every kick!*
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Mae Geri Kekomi</td>
<td class="org-left">Front thrust kick</td>
</tr>


<tr>
<td class="org-left">Mae Geri Keage</td>
<td class="org-left">Front snap kick</td>
</tr>


<tr>
<td class="org-left">Yoko Geri Kekomi</td>
<td class="org-left">Side thrust kick</td>
</tr>


<tr>
<td class="org-left">Yoko Geri Keage</td>
<td class="org-left">Side snap kick</td>
</tr>


<tr>
<td class="org-left">Kinsetsu Geri</td>
<td class="org-left">Joint kick, Knee break</td>
</tr>


<tr>
<td class="org-left">Mawashi Geri</td>
<td class="org-left">Roundhouse kick</td>
</tr>


<tr>
<td class="org-left">Fumi Komi Geri</td>
<td class="org-left">Stomp kick</td>
</tr>


<tr>
<td class="org-left">Ushiro Geri</td>
<td class="org-left">Back kick</td>
</tr>


<tr>
<td class="org-left">Ashi Barai</td>
<td class="org-left">Foot sweep</td>
</tr>


<tr>
<td class="org-left">Mikasuki Geri</td>
<td class="org-left">Crescent kick</td>
</tr>
</tbody>
</table>

<div class="org-center">
*Remember the joint sequence: All kicks start with the hips, work to the knee, and finish with the ankle.*
</div>


<a id="orgacc4085"></a>

# Kata  &#x2013;Forms

A *kata* is the execution of a pre-defined series of movements which simulates
a confrontation against multiple opponents.
As such, remember to place yourself in the midst of your enemies and to visualise them
&#x2013;this in turn necessitates rhythm and timing.
Moreover, full all-out intense kata will quickly demonstrate the importance of breathing.

\room
The key points of kata are:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Pace</td>
<td class="org-left">Breathing</td>
<td class="org-left">Eyes</td>
<td class="org-left">Focus</td>
<td class="org-left">Kiai</td>
<td class="org-left">Technique</td>
</tr>
</tbody>
</table>

<div class="org-center">
*Always concentrate on posture. Never rush through the kata.*
*You will become what you practice.* 
*If you rush your movements without purpose, your kata will become ragged and weak.*
</div>

\newpage

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">**Kata &#x2013;Forms**</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Taikyoku Gedan</td>
<td class="org-left">First course lower</td>
</tr>


<tr>
<td class="org-left">Taikyoku Chudan</td>
<td class="org-left">First course middle</td>
</tr>


<tr>
<td class="org-left">Taikyoku Jodan</td>
<td class="org-left">First course upper</td>
</tr>


<tr>
<td class="org-left">Taikyoku Mawashi Uke</td>
<td class="org-left">First course circular block</td>
</tr>


<tr>
<td class="org-left">Taikyoku Kake Uke</td>
<td class="org-left">First course hooking block</td>
</tr>


<tr>
<td class="org-left">Gekisai Itch</td>
<td class="org-left">Attack & Smash 1</td>
</tr>


<tr>
<td class="org-left">Gakisai Ni</td>
<td class="org-left">Attack & Smash 2</td>
</tr>


<tr>
<td class="org-left">Sanchin</td>
<td class="org-left">Three Battles</td>
</tr>


<tr>
<td class="org-left">Tensho</td>
<td class="org-left">Rotating Palm</td>
</tr>


<tr>
<td class="org-left">Saifa</td>
<td class="org-left">Destroy & Defeat</td>
</tr>


<tr>
<td class="org-left">Seienchin</td>
<td class="org-left">Attack, Conquer, Suppress</td>
</tr>


<tr>
<td class="org-left">San Sei Ryu</td>
<td class="org-left">Thirty-six movements</td>
</tr>


<tr>
<td class="org-left">Shi Sho Chin</td>
<td class="org-left">Twenty-seven movements</td>
</tr>


<tr>
<td class="org-left">Seisan</td>
<td class="org-left">Fifty-six movements</td>
</tr>


<tr>
<td class="org-left">Seipai</td>
<td class="org-left">Eighteen movements</td>
</tr>
</tbody>
</table>


<a id="org00ddd4c"></a>

# Goju History

-   Sixth century Indian Buddhist monk Bodhidharma immigrated to China is credited with being the father of the martial arts.
-   Okinawa is a large island between Japan and China where many Chinese immigrated for trade.
-   As a major trading post, Okinawa produced a composite fighting style known as *Te*, “hand”, a forerunner of *karate*, “empty hand”.
-   In 1904, it was introduced into Okinawan public schools as part of the physical education curriculum.
-   In 1915, Okinawan Gichin Funakoshi brought the art to Japan, founding shotokan karate.
    -   ‘Shoto’ is pine-waves and ‘kan’ is hall; shotokan was the name of his dojo.
-   Okinawan Miyagi Chojun popularised karate and incorporated Chinese forms to produce *goju ryu*, “hard soft style”.
    
    -   He revised sanchin –the hard aspect of goju– and created tensho– the soft aspect.
    -   These two kata are considered the essence of Goju Ryu.
    -   The highest kata, Suparinpei, is said to contain the full syllabus of Goju Ryu.
    
    He designed goju's official insignia: The goju fist, which is half open and half closed preserving the
    dichotomy that goju ryu is neither completely hard nor completely soft.
    
    -   The characters on the wrist read *go ju ryu*, while those on the banner read *kara te do*.
    -   Its colours are white symbolising the purity of the beginner, black associated with the ideals of being
        a black belt, and red for mastery of the artform –the more red shaded in, the higher the rank of the bearer.

-   Miyagi's student Gogen ‘the cat’ Yamaguchi formed the All-Japan Karate-do Goju-kai, spreading the style throughout the world.

<div class="org-center">
*The ultimate aim of karate lies not in victory or defeat but in the perfection of character of its participants.*
–Gichin Funakoshi
</div>

\newpage


<a id="org4071813"></a>

# Local Goju History

-   **Don Warrener, 6ᵗʰ Dan:** Popularised Goju across southern Ontario.
    -   Practising Goju since the age of 17; won the Canadian Karate Championships in 1968.
    -   Studied under Richard Kim, Bob Dalgleish, Frank Lee, and 
        Goshi Yamaguchi &#x2013;Gogen's son.

-   **Philip McColl, 5ᵗʰ Dan:** Sensei of McMaster Dojo since 1984
    &#x2013;the dojo was founded by Ray Greenway in 1969.
    -   Began Karate at the age of 24 at the Delta club in Hamilton, run by Don Warrener.
    -   Three of his graduated Shodans are World Champions
    -   Proficient in Goju Ryu, Kobudo &#x2013;weaponry&#x2013;, and Jujitsu.
    -   Student Chris Stafford is the founder and Sensei of the [Toronto Goju Ryu dojo](http://torontokarate.ca/).

<div class="org-center">
*The ultimate aim of karate lies not in victory or defeat,*
*but in the perfection of character of its participants.*
─Gichin Funakoshi
</div>


<a id="org3238bad"></a>

# General Terms

<div class="parallel">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Sensei</td>
<td class="org-left">teacher</td>
</tr>


<tr>
<td class="org-left">O'Sensei</td>
<td class="org-left">Teacher's teacher</td>
</tr>


<tr>
<td class="org-left">Dojo</td>
<td class="org-left">training hall</td>
</tr>


<tr>
<td class="org-left">Nippon</td>
<td class="org-left">Japan</td>
</tr>


<tr>
<td class="org-left">Kihon</td>
<td class="org-left">Basics</td>
</tr>


<tr>
<td class="org-left">Gi</td>
<td class="org-left">Uniform</td>
</tr>


<tr>
<td class="org-left">Obi</td>
<td class="org-left">Belt</td>
</tr>


<tr>
<td class="org-left">Kyu</td>
<td class="org-left">Boy</td>
</tr>


<tr>
<td class="org-left">Dan</td>
<td class="org-left">Man</td>
</tr>


<tr>
<td class="org-left">Mukso</td>
<td class="org-left">Meditate</td>
</tr>


<tr>
<td class="org-left">Kimi</td>
<td class="org-left">Focus</td>
</tr>


<tr>
<td class="org-left">Kilskai</td>
<td class="org-left">Attention</td>
</tr>


<tr>
<td class="org-left">Rei</td>
<td class="org-left">Bow</td>
</tr>


<tr>
<td class="org-left">Ashimai</td>
<td class="org-left">Begin</td>
</tr>


<tr>
<td class="org-left">Yemai</td>
<td class="org-left">Stop</td>
</tr>


<tr>
<td class="org-left">Kia</td>
<td class="org-left">Yell</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">[<span class="underline">Japanese Numbers</span>](https://www.linguajunkie.com/japanese/count-in-japanese-1-100)</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">rei</td>
</tr>


<tr>
<td class="org-right">1</td>
<td class="org-left">ichi</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-left">ni</td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-left">san</td>
</tr>


<tr>
<td class="org-right">4</td>
<td class="org-left">yon</td>
</tr>


<tr>
<td class="org-right">5</td>
<td class="org-left">go</td>
</tr>


<tr>
<td class="org-right">6</td>
<td class="org-left">roku</td>
</tr>


<tr>
<td class="org-right">7</td>
<td class="org-left">nana</td>
</tr>


<tr>
<td class="org-right">8</td>
<td class="org-left">hachi</td>
</tr>


<tr>
<td class="org-right">9</td>
<td class="org-left">kyuu</td>
</tr>


<tr>
<td class="org-right">10</td>
<td class="org-left">juu</td>
</tr>


<tr>
<td class="org-right">100</td>
<td class="org-left">hyaku</td>
</tr>


<tr>
<td class="org-right">1000</td>
<td class="org-left">sen</td>
</tr>
</tbody>
</table>

</div>

-   11, 12, …, 19  are juu ichi, juu ni, …, juu kyuu.
-   20, 30, …, 90  are ni juu, san juu, …, kyuu juu.
    -   Likewise, 200, …, 900 are ni hyaku, …, kyuu hyaku.
        -   Exceptions: 300 san byaku, 600 ro ppyaku, 800 ha ppyaku.
-   twenty-one, sixty-nine, eighty-two, … are 
    ni juu ichi, roku juu kyuu, hachi juu ni, … .
    -   Likewise, 368 is three hundred and sixty-eight which is san byaku roku juu hachi.

